---
kind: type
id: T:Autodesk.Revit.DB.ExternalService.ExecutionPolicy
source: html/5234000e-cf74-d7aa-85ff-dcfbed63434b.htm
---
# Autodesk.Revit.DB.ExternalService.ExecutionPolicy

Controls how servers of multi-server external services are executed.

## Syntax (C#)
```csharp
public enum ExecutionPolicy
```